# coding=utf-8
""""Complete collection of Urdu alphabet with unicode code point mapping"""

URDU_ALL_CHARACTERS_UNICODE_MAPPING = {'ـ': '\u0640', '،': '\u060c', '٫': '\u066b',
                                       '؛': '\u061b', '؟': '\u061f', '۔': '\u06d4', '٪': '\u066a', '۰': '\u06f0',
                                       '۱': '\u06f1',
                                       '۲': '\u06f2', '۳': '\u06f3', '۴': '\u06f4', '۵': '\u06f5', '۶': '\u06f6',
                                       '۷': '\u06f7',
                                       '۸': '\u06f8', '۹': '\u06f9', 'ء': '\u0621', 'آ': '\u0622', 'ؤ': '\u0624',
                                       'ئ': '\u0626',
                                       'ا': '\u0627', 'ب': '\u0628', 'پ': '\u067e', 'ت': '\u062a', 'ث': '\u062b',
                                       'ٹ': '\u0679',
                                       'ج': '\u062c', 'چ': '\u0686', 'ح': '\u062d', 'خ': '\u062e', 'د': '\u062f',
                                       'ذ': '\u0630',
                                       'ڈ': '\u0688', 'ر': '\u0631', 'ز': '\u0632', 'ڑ': '\u0691', 'ژ': '\u0698',
                                       'س': '\u0633',
                                       'ش': '\u0634', 'ص': '\u0635', 'ض': '\u0636', 'ط': '\u0637', 'ظ': '\u0638',
                                       'ع': '\u0639',
                                       'غ': '\u063a', 'ف': '\u0641', 'ق': '\u0642', 'ک': '\u06a9', 'گ': '\u06af',
                                       'ل': '\u0644',
                                       'م': '\u0645', 'ن': '\u0646', 'ں': '\u06ba', 'ه': '\u0647', 'ھ': '\u06be',
                                       'ہ': '\u06c1',
                                       'و': '\u0648', 'ی': '\u06cc', 'ے': '\u06d2'}

# Unicode Range (0600 - 06ff)
# http://jrgraphix.net/r/Unicode/0600-06FF
# https://www.unicode.org/charts/PDF/U0600.pdf
UNICODE_RANGE_0600_06ff = set("""

 ؀ ؁ ؂ ؃ ؄ ؅ ؆ ؇ ؈ ؉ ؊ ؋ ، ؍ ؎ ؏ ؐ ؑ ؒ ؓ ؔ ؕ ؖ ؗ ؘ ؙ ؚ ؛ ؜ ؝ ؞ ؟
 ؠ ء آ أ ؤ إ ئ ا ب ة ت ث ج ح خ د ذ ر ز س ش ص ض ط ظ ع غ ػ ؼ ؽ ؾ ؿ
 ـ ف ق ك ل م ن ه و ى ي ً ٌ ٍ َ ُ ِ ّ ْ ٓ ٔ ٕ ٖ ٗ ٘ ٙ ٚ ٛ ٜ ٝ ٞ ٟ
 ٠ ١ ٢ ٣ ٤ ٥ ٦ ٧ ٨ ٩ ٪ ٫ ٬ ٭ ٮ ٯ ٰ ٱ ٲ ٳ ٴ ٵ ٶ ٷ ٸ ٹ ٺ ٻ ټ ٽ پ ٿ
 ڀ ځ ڂ ڃ ڄ څ چ ڇ ڈ ډ ڊ ڋ ڌ ڍ ڎ ڏ ڐ ڑ ڒ ړ ڔ ڕ ږ ڗ ژ ڙ ښ ڛ ڜ ڝ ڞ ڟ
 ڠ ڡ ڢ ڣ ڤ ڥ ڦ ڧ ڨ ک ڪ ګ ڬ ڭ ڮ گ ڰ ڱ ڲ ڳ ڴ ڵ ڶ ڷ ڸ ڹ ں ڻ ڼ ڽ ھ ڿ
 ۀ ہ ۂ ۃ ۄ ۅ ۆ ۇ ۈ ۉ ۊ ۋ ی ۍ ێ ۏ ې ۑ ے ۓ ۔ ە ۖ ۗ ۘ ۙ ۚ ۛ ۜ ۝ ۞ ۟
 ۠ ۡ ۢ ۣ ۤ ۥ ۦ ۧ ۨ ۩ ۪ ۫ ۬ ۭ ۮ ۯ ۰ ۱ ۲ ۳ ۴ ۵ ۶ ۷ ۸ ۹ ۺ ۻ ۼ ۽ ۾ ۿ

""".split())
