# coding: utf8
"""
Complete collection of Urdu alphabet.
"""
from __future__ import unicode_literals

# Digits from 0 to 9
URDU_DIGITS = frozenset(""" ۰ ۱ ۲ ۳ ۴ ۵ ۶ ۷ ۸ ۹ """)

# Complete set of Urdu alphabet
URDU_ALPHABET_COMPLETE = frozenset("""

  آ ا ب پ ت ٹ ث ج چ ح خ د ڈ ذ ر ڑ ز ژ
 س ش ص ض ط ظ ع غ ف ق ک گ ل م ن ں و ؤ ہ ه ھ ء ی ئ ے ‬

""".split())

# Urdu punctuation
URDU_PUNCTUATION = frozenset("""

 ؛ ، ٠  ٫ ـ ؟ ۔ ٭ ٬ ٪

""".split())

#############################################
# Char to Integer, Char to Hex mapping
URDU_DIGITS_UNICODE_MAPPING_INTEGER = {'۰': 1776, '۱': 1777, '۲': 1778, '۳': 1779, '۴': 1780, '۵': 1781, '۶': 1782,
                                       '۷': 1783, '۸': 1784, '۹': 1785}
URDU_DIGITS_UNICODE_MAPPING_HEX = {'۰': '06f0', '۱': '06f1', '۲': '06f2', '۳': '06f3', '۴': '06f4', '۵': '06f5',
                                   '۶': '06f6', '۷': '06f7', '۸': '06f8', '۹': '06f9'}

URDU_ALPHABET_COMPLETE_UNICODE_MAPPING_INTEGER = {'ء': 1569, 'آ': 1570, 'ؤ': 1572, 'ئ': 1574, 'ا': 1575,
                                                  'ب': 1576, 'پ': 1662, 'ت': 1578, 'ث': 1579, 'ٹ': 1657, 'ج': 1580,
                                                  'چ': 1670, 'ح': 1581, 'خ': 1582, 'د': 1583, 'ذ': 1584, 'ڈ': 1672,
                                                  'ر': 1585, 'ز': 1586, 'ڑ': 1681, 'ژ': 1688, 'س': 1587, 'ش': 1588,
                                                  'ص': 1589, 'ض': 1590, 'ط': 1591, 'ظ': 1592, 'ع': 1593, 'غ': 1594,
                                                  'ف': 1601, 'ق': 1602, 'ک': 1705, 'گ': 1711, 'ل': 1604, 'م': 1605,
                                                  'ن': 1606, 'ں': 1722, 'ه': 1607, 'ھ': 1726, 'ہ': 1729, 'و': 1608,
                                                  'ی': 1740, 'ے': 1746}

URDU_ALPHABET_COMPLETE_UNICODE_MAPPING_HEX = {'ء': '0621', 'آ': '0622', 'ؤ': '0624', 'ئ': '0626',
                                              'ا': '0627', 'ب': '0628', 'پ': '067e', 'ت': '062a', 'ث': '062b',
                                              'ٹ': '0679', 'ج': '062c', 'چ': '0686', 'ح': '062d', 'خ': '062e',
                                              'د': '062f', 'ذ': '0630', 'ڈ': '0688', 'ر': '0631', 'ز': '0632',
                                              'ڑ': '0691', 'ژ': '0698', 'س': '0633', 'ش': '0634', 'ص': '0635',
                                              'ض': '0636', 'ط': '0637', 'ظ': '0638', 'ع': '0639', 'غ': '063a',
                                              'ف': '0641', 'ق': '0642', 'ک': '06a9', 'گ': '06af', 'ل': '0644',
                                              'م': '0645', 'ن': '0646', 'ں': '06ba', 'ه': '0647', 'ھ': '06be',
                                              'ہ': '06c1', 'و': '0648', 'ی': '06cc', 'ے': '06d2'}
